# Pandas

## 1. Creating Dataframes

### 1.1 Using csv

In [123]:
import pandas as pd
df = pd.read_csv('/Users/umasid/Shankar Personal/Data Science/Learning/Python Learning/Datasets/weather_data.csv')

In [124]:
df.shape   # gives the dimensions of the dataframe

(6, 4)

In [127]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [7]:
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

### 1.2 Create Dataframes - Using list of Tuples

In [9]:
weather_data = [('1/1/2010', 32, 6, 'Rain'),
                ('1/2/2010', 34, 7, 'Sunny'),
                ('1/3/2010', 28, 8, 'Snow'),
                ('1/4/2010', 26, 13, 'Rain'),
                ('1/5/2010', 30, 2, 'Sunny')]

df = pd.DataFrame(weather_data, columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2010           32          6   Rain
1  1/2/2010           34          7  Sunny
2  1/3/2010           28          8   Snow
3  1/4/2010           26         13   Rain
4  1/5/2010           30          2  Sunny

## 2. Miscillinious operations

### 2.1 Shape/dimensions of the dataframe

In [15]:
df.shape

(5, 4)

### 2.2 Get column names of the df

In [128]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

### 2.3 Accessing columns in the df

In [23]:
df.day

0    1/1/2010
1    1/2/2010
2    1/3/2010
3    1/4/2010
4    1/5/2010
Name: day, dtype: object

In [24]:
# another way of accessing the column in a df
df['day']

0    1/1/2010
1    1/2/2010
2    1/3/2010
3    1/4/2010
4    1/5/2010
Name: day, dtype: object

In [27]:
# get 2 or more columns in the df

df[['day','temperature']]

        day  temperature
0  1/1/2010           32
1  1/2/2010           34
2  1/3/2010           28
3  1/4/2010           26
4  1/5/2010           30

### 2.4 Maximum & Minimum value in a column

In [29]:
df['temperature'].max()

34

In [30]:
df['temperature'].min()

26

### 2.5 Get Stats on a column or describe a column

In [130]:
df['temperature'].describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

### 2.6 Select rows which has the maximum temperature

In [33]:
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2010           34          7  Sunny

### 2.7 Give the day column data for the maximum temperature record

In [34]:
df.day[df.temperature==df['temperature'].max()]

1    1/2/2010
Name: day, dtype: object

## 3. Slicing

In [10]:
df[2:5]

        day  temperature  windspeed  event
2  1/3/2010           28          8   Snow
3  1/4/2010           26         13   Rain
4  1/5/2010           30          2  Sunny

In [11]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

## 4. Writing the data to a file and save it

In [35]:
df = pd.read_csv('/Users/umasid/Shankar Personal/Data Science/Learning/Python Learning/Datasets/weather_data.csv')

In [42]:
# with the below command the file new.csv is stored in the given location and also includes a index as well.
df.to_csv('/Users/umasid/Shankar Personal/Data Science/Learning/Python Learning/Datasets/new.csv')

In [44]:
# store the file without index
df.to_csv('/Users/umasid/Shankar Personal/Data Science/Learning/Python Learning/Datasets/new_noIndex.csv', index=False)

To open Excel files we have to install <b>xlrd</b> package using pip3 install xlrd command.
use <b>df = pd.read_excel('weather_data.xlsx)</b>

To store files in Excel we have to install <b>openpyxl</b> package using pip3 install openpyxl command.
use <b>df.to_excel('new.xlsx', sheet_name='weather_data')</b>

# 5. Group-by

Pandas groupby work on a priciple of <b> Split, Apply & Combine </b> 
First the data is split into groups using the given criteria and then apply the required function on each of the groups and then combine the results and give the output.

In [131]:
df = pd.read_csv('Datasets/weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [132]:
g = df.groupby('city')  # this groups all the rows with the same city name
g

### Looking at all the created groups

In [59]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

## 5.1 access each group individually (using the group name)

In [62]:
g.get_group('paris')

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

## 5.2 Analytics on the groups

In [71]:
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [72]:
g.min()

               day  temperature  windspeed   event
city
mumbai    1/1/2017           85          5     Fog
new york  1/1/2017           28          6    Rain
paris     1/1/2017           42          8  Cloudy

In [73]:
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

### Get Stats of the numerical columns in each group

In [135]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# 6. Concatenate Data Frames

In [80]:
india_weather = pd.DataFrame({'city':['mumbai','bangalore','hyderabad'],
                              'temperature': [32, 28, 38],
                              'humidity':[32, 12, 34]})
india_weather

        city  temperature  humidity
0     mumbai           32        32
1  bangalore           28        12
2  hyderabad           38        34

In [81]:
us_weather = pd.DataFrame({'city':['newyork', 'chicago', 'boston'],
                           'temperature':[25, 28, 20],
                           'humidity': [26, 19, 30]})
us_weather

      city  temperature  humidity
0  newyork           25        26
1  chicago           28        19
2   boston           20        30

In [90]:
df = pd.concat([india_weather, us_weather], ignore_index = True) # if we don't use ignore_index then the new 
                                                                 # concatenated df will have the old indexes. 
                                                                 # So, the indices 0,1,2 will be there 2 times
#df = pd.concat([india_weather, us_weather])
df

        city  temperature  humidity
0     mumbai           32        32
1  bangalore           28        12
2  hyderabad           38        34
3    newyork           25        26
4    chicago           28        19
5     boston           20        30

## 6.2 Concatenate Column-wise

In [93]:
df = pd.concat([india_weather, us_weather], axis=1)  # axis=1 means column wise concatenation
df

        city  temperature  humidity     city  temperature  humidity
0     mumbai           32        32  newyork           25        26
1  bangalore           28        12  chicago           28        19
2  hyderabad           38        34   boston           20        30

# 7. Merge DataFrames

In [94]:
temp_df = pd.DataFrame({'city':['Delhi', 'Mumbai', 'Hyderabad'],
                        'temperature':[23, 28, 30]})

hmd_df = pd.DataFrame({'city':['Mumbai', 'Delhi', 'Chennai', 'Bangalore'],
                       'humidity': [30, 28, 50, 20]})

## 7.1 Inner Join

In [99]:
# Inner Join
pd.merge(temp_df, hmd_df, on='city')

     city  temperature  humidity
0   Delhi           23        28
1  Mumbai           28        30

## 7.2 Outer Join

In [100]:
# Outer join
pd.merge(hmd_df, temp_df, on='city', how='outer')

        city  humidity  temperature
0     Mumbai      30.0         28.0
1      Delhi      28.0         23.0
2    Chennai      50.0          NaN
3  Bangalore      20.0          NaN
4  Hyderabad       NaN         30.0

## 7.3 Left Outer Join

In [101]:
# Left outer join
pd.merge(temp_df, hmd_df, on='city', how='left')

        city  temperature  humidity
0      Delhi           23      28.0
1     Mumbai           28      30.0
2  Hyderabad           30       NaN

## 7.4 Right Outer Join

In [103]:
# Right outer join
pd.merge(temp_df, hmd_df, on='city', how='right')

        city  temperature  humidity
0     Mumbai         28.0        30
1      Delhi         23.0        28
2    Chennai          NaN        50
3  Bangalore          NaN        20

# 8. Numerical Indexing (.loc vs iloc)

While creating any dataframe, there is an indexing column which is automatically created. By default the row number is the default index. We can write our own index also.

In [110]:
df1 = pd.DataFrame([1,2,3,4], index=[45, 43, 46, 34])  # run the same command without index and observe that 
                                                      # we will see the default index as 0,1,2,3
df1

    0
45  1
43  2
46  3
34  4

<b>loc</b> - stands for location.. Here it looks for the given <b>index number.</b>

<b>iloc</b> - stands for index location... Here it looks for the given <b> row number</b>

In [115]:
df1.loc[46] # using index to access the data and NOT the row number

0    3
Name: 46, dtype: int64

In [114]:
df1.iloc[2]  # here we are using the rownumber to access the data

0    3
Name: 46, dtype: int64

In [119]:
df1.loc[:46]  # It gives all the rows untill it sees index 46

    0
45  1
43  2
46  3

In [122]:
df1.iloc[:2]  # It gives all the rows untill the row number =2

    0
45  1
43  2

<b> Note:</b> When you don't have a custom index then, the loc and iloc will behave exactly the same, as the default index starts as 0,1,2,3...